"""
座右铭:将来的你一定会感激现在拼命的自己
@project:正课
@author:Mr.Chen
@file:面向过程和面向对象.PY
@ide:PyCharm
@time:2018-07-30 09:31:43
"""
# 解决菜鸟买手机的难题
# 第一种:
# 第一步：查找资料，比对几款手机的配置和价格，来最终决定买那一款
# 第二步：根据自己的小金库还有自己对手机的需求，决定买个iPhonex
# 第三步：拿着钱去实体店买手机，业务员听说要买iPhonex，她给你推荐了一款手机iPhonexx，他一忽悠，说买iPhonexx比iPhonex更便宜，配置也更高。于是一想反正都是iPhone，最终买了iPhonexx。
# 第四步：砍价，最终8000块钱买了个iPhonexx。
# 第五步：结账付款，拿到手机。
# 第六步：回到家，欣喜万分的拆开手机，最终发现是山寨版


# 第二种方式:
# 找一个懂手机的专业人士,把钱给他让他给你买

# 买手机的第一种方式:强调的是过程,步骤,每一步都需要自己去亲自实现,这种解决问题的思路叫做面向过程.
# 买手机的第二种方式:强调的是专业人士这个对象,使用专业人士买手机,菜鸟不需要亲自一步一步的去实现买手机的这个过程,所有的难题都交给了专业人士来解决,这种解决问题的思路叫做面向对象.

# 面向对象的思维解决问题的重点:
# 1.当遇到一个需求的时候,不用自己一步一步去实现.
# 2.找一个专业的人士来完成买手机的这个过程.

# 面向对象是基于面向过程的

# 面试题可能会问到的概念:
# 面向对象OO：面向对象是一种对现实世界理解和抽象的方法，是计算机编程技术 发展到一定阶段后的产物。
# 面向对象编程OOP：OOP把对象作为程序的基本单元，一个对象包含了数据和操作数据的函数。
# 面向对象分析OOA：一种新的系统分析方法.它是采用面向对象的风格进行系统分析和需求定义的重要方法.面向对象分析的关键在于理解问题空间并将其模型化。
# 面向对象设计OOD：是一种软件设计方法，是一种工程化规范。面向对象设计模式解决的是“类与相互通信的对象之间的组织关系，包括它们的角色、职责、协作方式几个方面。






