"""
座右铭:将来的你一定会感激现在拼命的自己
@project:正课
@author:Mr.Chen
@file:URL简介.PY
@ide:PyCharm
@time:2018-08-06 09:02:54
"""
# 1.什么是URl？
# url（统一资源占位符）也就是我们所说的网址，统一资源占位符是对可以从互联网上得到的资源的位置和访问的一种简洁的表示，是从互联网上标准资源的地址。
# http://www.yundama.com/resources/focus/3.jpg
# 1.URL的组成部分：
# 第一部分协议：或者叫做服务方式http/https
# 第二部分：是存有资源的主机IP地址（有时候也会包括端口号）
# 第三部分：主机资源的具体地址，如目录或者文件名等。

# URL的完整格式：
# 1.协议(http/https/ftp..)
# 2.服务器的IP地址或者域名。
# 3.服务器端口号（80,8080等）
# 4.访问资源的路径。
# 5.参数，发送给http服务器的数据。

# 端口：一台服务器ip地址的主机可以提供很多种服务，如web服务，ftp服务，smtp服务(邮件)，那么主机是怎么区别这些服务的呢？为了区别这些服务，于是通过ip地址+端口号来区别这些不同的服务。

# 常用的端口号（常识，必须会）
# HTTP的端口号：80
# HTTPS的端口号：443
# 邮箱的端口号：25
# 数据库的端口号：3306
# 微信的端口号：80












